"""
座右铭:吃饱不饿，努力学习
@project:预科
@author:Mr.Huang
@file:面向过程和面向对象.PY
@ide:PyCharm
@time:2018-07-30 09:32:21
"""
#面向过程和面向对象


#解决菜鸟买手机的难题
#第一步:查找资料,互相比对手机的配置和价格,来最终决定买哪一款
#第二步:根据自己的能力还有手机需求,决定,买哪一个Iphonex
#第三步:拿着钱去实体店买手机,业务员听说要买iphonex,他给你推荐了手机iphonexx比iphonex更便宜,配置更高,于是一想都是iphone最终买了iphonexx
#第四步:砍价,最终8000买了iphonexx
#第五步:结账付款,拿到手机
#第六步:回家,拆手机,最终发现是假货


#第二种方式

#找一个动手机的专业人士,帮你买


#买手机第一种方式;强调的是过程,,步骤:每一步都需要自己亲自去买,这种解决问题的思路叫做面向过程

#买手机第二种方式:强调的是专业人士,这个对象,使用专业人士,菜鸟不需要一步一步去实现买手机,的这个过程,所有的难题都交给了专业人士来解决,这种解决问题的思路是面向对象


#面向对象的思维解决问题的重点
#1-当遇到一个需求不用自己一步一步去实现,
#2-找一个专业人士来完成买手机的过程


#面向对象是基于面向过程的

#面向对象(00)
# 面向对象编程(OOP)
# 面向对象分析(OOA)
# 面向对象设计(OOO)


