# 练习一：模拟手机通讯录的搜索过程(列表和字典)
dict1={}
list_student=['郝超杰','李威','吕朝朝','张广师','李宇恒','池永伟','黄保安','陈鹏','余江帆','曹森','郑慧诏','郭克松','高翔','杨建宇','孟新珂','司金辉','张梦冉','王坤峰','蔡飞','樊俊','张稼瑞','吴亚涛','葛成云','王鹏基','樊俊峰','张崇雷','陈泽坤','王震宇','曾一飞','凌晨洋','郑雪鹏','李鑫一','晋吉祥','王晓茹','陶林','范雪婷','岳银龙','王继涛','张力方','牛铭瑞','马深凌','楚少杰','刘家豪']
list_student2=['郝','李','吕','张','李','池','黄','陈','余','曹','郑','郭','高','杨','孟','司','张','王','蔡','樊','张','吴','葛','王','樊','张','陈','王','曾','凌','郑','李','晋','王','陶','范','岳','王','张','牛','马','楚','刘']
dict(zip(list_student2,list_student))
print(dict)












