# --------------算术运算符----
# +
# -
# *
# /
# //整除
# %取余
# .**幂
a=10
b=3
c=a%b
print(c)
print(a**2)
# ----------比较运算符----
# == 判断左右两边的值是否相等
# != 比较左右两边的值是否不相等
# > 比较左边的值是否大于右边的值
# < 比较左边的值是否小于右边的值
# >=比较左边的值是否大于等于右边的值
# <=比较左边的值是否小于等于右边的值
# ------------赋值运算符---------
# =,简单赋值运算符
# a=b+c 等效于将b+c的值赋给a
# +=   等效于 a+=b   等效于a=a+b
# -=    a-=b 等效于a=a-b
# *=   a*=b  等效于 a=a*b
# /=   a/=b等效于a=a/b
# % 取余赋值运算符 a%=b 等效于 a= a%b
# **= 幂赋值运算符 a**=b 等效于 a= a**b
# //= 整出运算符  a//=b等效于  a= a//b
# -----------逻辑运算符----------------
# and 与 a and b a 条件与b 条件同时成立 结果是True
# 如果其中一个不满足结果是 False
# or 或 a or b其中一个条件满足结果是true
# 两个条件都不满足,结果是false
# not 非 not a  条件a 是true 结果是false
# 如果a条件不满足,则结果为true
# -----------成员运算符--------
# in   ——  a in b 判断a 是否在b中 如果a在b中返回true 如果不在则返回false
# not in   ————a not in b 判断a 是否不再b中如果不在则返回true 如果在则返回false
# ---------------------身份运算符------------]
# is __ a is b 判断对象a和对象b是否为同一对象,如果 是返回ture如果不是则返回false
